choco-technologies/dmgpio/src/port/stm32f7/port.c
#define DMOD_ENABLE_REGISTRATION    ON
#include "dmgpio_port.h"
#include "port/stm32_gpio_regs.h"
#include <stddef.h>

/* STM32F7 GPIO base addresses */
#define STM32F7_GPIOA_BASE  0x40020000U
#define STM32F7_GPIOB_BASE  0x40020400U
#define STM32F7_GPIOC_BASE  0x40020800U
#define STM32F7_GPIOD_BASE  0x40020C00U
#define STM32F7_GPIOE_BASE  0x40021000U
#define STM32F7_GPIOF_BASE  0x40021400U
#define STM32F7_GPIOG_BASE  0x40021800U
#define STM32F7_GPIOH_BASE  0x40021C00U
#define STM32F7_GPIOI_BASE  0x40022000U
#define STM32F7_GPIOJ_BASE  0x40022400U
#define STM32F7_GPIOK_BASE  0x40022800U

#define STM32F7_RCC_BASE    0x40023800U
#define STM32F7_RCC_AHB1ENR (*(volatile uint32_t *)(STM32F7_RCC_BASE + 0x30U))

#define STM32F7_GPIO_PORT_COUNT 11U

static const uint32_t gpio_base_addresses[STM32F7_GPIO_PORT_COUNT] = {
    STM32F7_GPIOA_BASE, STM32F7_GPIOB_BASE, STM32F7_GPIOC_BASE,
    STM32F7_GPIOD_BASE, STM32F7_GPIOE_BASE, STM32F7_GPIOF_BASE,
    STM32F7_GPIOG_BASE, STM32F7_GPIOH_BASE, STM32F7_GPIOI_BASE,
    STM32F7_GPIOJ_BASE, STM32F7_GPIOK_BASE,
};

/* Per-port pin usage bitmasks */
static uint16_t pin_used_mask[STM32F7_GPIO_PORT_COUNT];

static dmgpio_interrupt_handler_t interrupt_handler = NULL;

static GPIO_TypeDef *get_gpio(dmgpio_port_t port)
{
    if (port >= STM32F7_GPIO_PORT_COUNT) return NULL;
    return (GPIO_TypeDef *)gpio_base_addresses[port];
}

int dmod_init(const Dmod_Config_t *Config)
{
    for (dmgpio_port_t i = 0; i < STM32F7_GPIO_PORT_COUNT; i++)
        pin_used_mask[i] = 0;
    interrupt_handler = NULL;
    Dmod_Printf("dmgpio port module initialized (STM32F7)\n");
    return 0;
}

int dmod_deinit(void)
{
    for (dmgpio_port_t i = 0; i < STM32F7_GPIO_PORT_COUNT; i++)
        pin_used_mask[i] = 0;
    interrupt_handler = NULL;
    Dmod_Printf("dmgpio port module deinitialized (STM32F7)\n");
    return 0;
}

dmod_dmgpio_port_api_declaration(1.0, int, _turn_on_driver, ( void ))
{
    return 0;
}

dmod_dmgpio_port_api_declaration(1.0, int, _turn_off_driver, ( void ))
{
    return 0;
}

dmod_dmgpio_port_api_declaration(1.0, int, _set_driver_interrupt_handler,
    ( dmgpio_interrupt_handler_t handler ))
{
    interrupt_handler = handler;
    return 0;
}

dmod_dmgpio_port_api_declaration(1.0, int, _begin_configuration,
    ( dmgpio_port_t port, dmgpio_pin_t pin ))
{
    (void)port; (void)pin;
    return 0;
}

dmod_dmgpio_port_api_declaration(1.0, int, _finish_configuration,
    ( dmgpio_port_t port, dmgpio_pin_t pin ))
{
    (void)port; (void)pin;
    return 0;
}

dmod_dmgpio_port_api_declaration(1.0, int, _set_power,
    ( dmgpio_port_t port, int power_on ))
{
    if (port >= STM32F7_GPIO_PORT_COUNT) return -1;
    if (power_on)
        STM32F7_RCC_AHB1ENR |= (1U << port);
    else
        STM32F7_RCC_AHB1ENR &= ~(1U << port);
    (void)STM32F7_RCC_AHB1ENR; /* read-back for clock stabilisation */
    return 0;
}

dmod_dmgpio_port_api_declaration(1.0, int, _is_pin_protected,
    ( dmgpio_port_t port, dmgpio_pin_t pin ))
{
    (void)port; (void)pin;
    return 0;
}

dmod_dmgpio_port_api_declaration(1.0, int, _unlock_protection,
    ( dmgpio_port_t port, dmgpio_pin_t pin, dmgpio_protection_t protection ))
{
    (void)port; (void)pin; (void)protection;
    return 0;
}

dmod_dmgpio_port_api_declaration(1.0, int, _lock_protection,
    ( dmgpio_port_t port, dmgpio_pin_t pin ))
{
    (void)port; (void)pin;
    return 0;
}

dmod_dmgpio_port_api_declaration(1.0, int, _set_mode,
    ( dmgpio_port_t port, dmgpio_pin_t pin, dmgpio_mode_t mode ))
{
    GPIO_TypeDef *gpio = get_gpio(port);
    if (gpio == NULL || pin > 15U) return -1;
    uint32_t val;
    switch (mode)
    {
        case dmgpio_mode_output:    val = GPIO_MODER_OUTPUT; break;
        case dmgpio_mode_alternate: val = GPIO_MODER_AF;     break;
        default:                    val = GPIO_MODER_INPUT;  break;
    }
    gpio->MODER = (gpio->MODER & ~(0x3U << (pin * 2U))) | (val << (pin * 2U));
    return 0;
}

dmod_dmgpio_port_api_declaration(1.0, int, _read_mode,
    ( dmgpio_port_t port, dmgpio_pin_t pin, dmgpio_mode_t *out_mode ))
{
    GPIO_TypeDef *gpio = get_gpio(port);
    if (gpio == NULL || pin > 15U || out_mode == NULL) return -1;
    uint32_t val = (gpio->MODER >> (pin * 2U)) & 0x3U;
    switch (val)
    {
        case GPIO_MODER_OUTPUT: *out_mode = dmgpio_mode_output;    break;
        case GPIO_MODER_AF:     *out_mode = dmgpio_mode_alternate; break;
        default:                *out_mode = dmgpio_mode_input;     break;
    }
    return 0;
}

dmod_dmgpio_port_api_declaration(1.0, int, _set_output_circuit,
    ( dmgpio_port_t port, dmgpio_pin_t pin, dmgpio_output_circuit_t oc ))
{
    GPIO_TypeDef *gpio = get_gpio(port);
    if (gpio == NULL || pin > 15U) return -1;
    if (oc == dmgpio_output_circuit_open_drain)
        gpio->OTYPER |= (1U << pin);
    else
        gpio->OTYPER &= ~(1U << pin);
    return 0;
}

dmod_dmgpio_port_api_declaration(1.0, int, _read_output_circuit,
    ( dmgpio_port_t port, dmgpio_pin_t pin, dmgpio_output_circuit_t *out_oc ))
{
    GPIO_TypeDef *gpio = get_gpio(port);
    if (gpio == NULL || pin > 15U || out_oc == NULL) return -1;
    *out_oc = (gpio->OTYPER & (1U << pin)) ?
        dmgpio_output_circuit_open_drain : dmgpio_output_circuit_push_pull;
    return 0;
}

dmod_dmgpio_port_api_declaration(1.0, int, _set_speed,
    ( dmgpio_port_t port, dmgpio_pin_t pin, dmgpio_speed_t speed ))
{
    GPIO_TypeDef *gpio = get_gpio(port);
    if (gpio == NULL || pin > 15U) return -1;
    uint32_t val;
    switch (speed)
    {
        case dmgpio_speed_medium:  val = GPIO_OSPEEDR_MEDIUM;    break;
        case dmgpio_speed_maximum: val = GPIO_OSPEEDR_VERY_HIGH; break;
        default:                   val = GPIO_OSPEEDR_LOW;       break;
    }
    gpio->OSPEEDR = (gpio->OSPEEDR & ~(0x3U << (pin * 2U))) | (val << (pin * 2U));
    return 0;
}

dmod_dmgpio_port_api_declaration(1.0, int, _read_speed,
    ( dmgpio_port_t port, dmgpio_pin_t pin, dmgpio_speed_t *out_speed ))
{
    GPIO_TypeDef *gpio = get_gpio(port);
    if (gpio == NULL || pin > 15U || out_speed == NULL) return -1;
    uint32_t val = (gpio->OSPEEDR >> (pin * 2U)) & 0x3U;
    switch (val)
    {
        case GPIO_OSPEEDR_MEDIUM:    *out_speed = dmgpio_speed_medium;  break;
        case GPIO_OSPEEDR_HIGH:      /* fall-through */
        case GPIO_OSPEEDR_VERY_HIGH: *out_speed = dmgpio_speed_maximum; break;
        default:                     *out_speed = dmgpio_speed_minimum; break;
    }
    return 0;
}

dmod_dmgpio_port_api_declaration(1.0, int, _set_current,
    ( dmgpio_port_t port, dmgpio_pin_t pin, dmgpio_current_t current ))
{
    /* STM32F7 does not have a separate current register */
    (void)port; (void)pin; (void)current;
    return 0;
}

dmod_dmgpio_port_api_declaration(1.0, int, _read_current,
    ( dmgpio_port_t port, dmgpio_pin_t pin, dmgpio_current_t *out_current ))
{
    (void)port; (void)pin;
    if (out_current == NULL) return -1;
    *out_current = dmgpio_current_default;
    return 0;
}

dmod_dmgpio_port_api_declaration(1.0, int, _set_pull,
    ( dmgpio_port_t port, dmgpio_pin_t pin, dmgpio_pull_t pull ))
{
    GPIO_TypeDef *gpio = get_gpio(port);
    if (gpio == NULL || pin > 15U) return -1;
    uint32_t val;
    switch (pull)
    {
        case dmgpio_pull_up:   val = GPIO_PUPDR_UP;   break;
        case dmgpio_pull_down: val = GPIO_PUPDR_DOWN; break;
        default:               val = GPIO_PUPDR_NONE; break;
    }
    gpio->PUPDR = (gpio->PUPDR & ~(0x3U << (pin * 2U))) | (val << (pin * 2U));
    return 0;
}

dmod_dmgpio_port_api_declaration(1.0, int, _read_pull,
    ( dmgpio_port_t port, dmgpio_pin_t pin, dmgpio_pull_t *out_pull ))
{
    GPIO_TypeDef *gpio = get_gpio(port);
    if (gpio == NULL || pin > 15U || out_pull == NULL) return -1;
    uint32_t val = (gpio->PUPDR >> (pin * 2U)) & 0x3U;
    switch (val)
    {
        case GPIO_PUPDR_UP:   *out_pull = dmgpio_pull_up;      break;
        case GPIO_PUPDR_DOWN: *out_pull = dmgpio_pull_down;    break;
        default:              *out_pull = dmgpio_pull_default;  break;
    }
    return 0;
}

dmod_dmgpio_port_api_declaration(1.0, int, _set_interrupt_trigger,
    ( dmgpio_port_t port, dmgpio_pin_t pin, dmgpio_int_trigger_t trigger ))
{
    /* EXTI/NVIC configuration is application-specific; stub here */
    (void)port; (void)pin; (void)trigger;
    return 0;
}

dmod_dmgpio_port_api_declaration(1.0, int, _read_interrupt_trigger,
    ( dmgpio_port_t port, dmgpio_pin_t pin, dmgpio_int_trigger_t *out_trigger ))
{
    (void)port; (void)pin;
    if (out_trigger == NULL) return -1;
    *out_trigger = dmgpio_int_trigger_off;
    return 0;
}

dmod_dmgpio_port_api_declaration(1.0, int, _set_pins_used,
    ( dmgpio_port_t port, dmgpio_pins_mask_t pins ))
{
    if (port >= STM32F7_GPIO_PORT_COUNT) return -1;
    pin_used_mask[port] |= pins;
    return 0;
}

dmod_dmgpio_port_api_declaration(1.0, int, _set_pins_unused,
    ( dmgpio_port_t port, dmgpio_pins_mask_t pins ))
{
    if (port >= STM32F7_GPIO_PORT_COUNT) return -1;
    pin_used_mask[port] &= ~pins;
    return 0;
}

dmod_dmgpio_port_api_declaration(1.0, int, _check_is_pin_used,
    ( dmgpio_port_t port, dmgpio_pin_t pin, int *out_used ))
{
    if (port >= STM32F7_GPIO_PORT_COUNT || pin > 15U || out_used == NULL) return -1;
    *out_used = (pin_used_mask[port] & (1U << pin)) ? 1 : 0;
    return 0;
}

dmod_dmgpio_port_api_declaration(1.0, int, _write_data,
    ( dmgpio_port_t port, dmgpio_pins_mask_t pins, dmgpio_pins_mask_t data ))
{
    GPIO_TypeDef *gpio = get_gpio(port);
    if (gpio == NULL) return -1;
    uint32_t set_bits   = (uint32_t)(pins &  data);
    uint32_t reset_bits = (uint32_t)(pins & ~data);
    gpio->BSRR = set_bits | (reset_bits << 16U);
    return 0;
}

dmod_dmgpio_port_api_declaration(1.0, int, _read_data,
    ( dmgpio_port_t port, dmgpio_pins_mask_t pins, dmgpio_pins_mask_t *out_data ))
{
    GPIO_TypeDef *gpio = get_gpio(port);
    if (gpio == NULL || out_data == NULL) return -1;
    *out_data = (dmgpio_pins_mask_t)(gpio->IDR & pins);
    return 0;
}

dmod_dmgpio_port_api_declaration(1.0, dmgpio_pins_mask_t, _get_high_state_pins,
    ( dmgpio_port_t port, dmgpio_pins_mask_t pins ))
{
    GPIO_TypeDef *gpio = get_gpio(port);
    if (gpio == NULL) return 0;
    return (dmgpio_pins_mask_t)(gpio->IDR & pins);
}

dmod_dmgpio_port_api_declaration(1.0, dmgpio_pins_mask_t, _get_low_state_pins,
    ( dmgpio_port_t port, dmgpio_pins_mask_t pins ))
{
    GPIO_TypeDef *gpio = get_gpio(port);
    if (gpio == NULL) return 0;
    return (dmgpio_pins_mask_t)(pins & ~gpio->IDR);
}

dmod_dmgpio_port_api_declaration(1.0, void, _set_pins_state,
    ( dmgpio_port_t port, dmgpio_pins_mask_t pins, dmgpio_pins_state_t state ))
{
    GPIO_TypeDef *gpio = get_gpio(port);
    if (gpio == NULL) return;
    if (state == dmgpio_pins_state_all_high)
        gpio->BSRR = (uint32_t)pins;
    else
        gpio->BSRR = (uint32_t)pins << 16U;
}

dmod_dmgpio_port_api_declaration(1.0, void, _toggle_pins_state,
    ( dmgpio_port_t port, dmgpio_pins_mask_t pins ))
{
    GPIO_TypeDef *gpio = get_gpio(port);
    if (gpio == NULL) return;
    uint32_t odr_val    = gpio->ODR;
    uint32_t set_bits   = (~odr_val) & pins;
    uint32_t reset_bits = odr_val    & pins;
    gpio->BSRR = set_bits | (reset_bits << 16U);
}
